#Использовать 1commands

&Деталька("UNPACK")
Перем СпособРазбора; //Метод, разбирать через exe или через pythot, варианты exe, py

&ЛогПубликация
Перем Лог;

&Табакерка 
&Пластилин
Перем КомандаЗапускаДекомпилятора;

&Желудь
Процедура ПриСозданииОбъекта()
	
КонецПроцедуры

Процедура РазобратьФайл(ПутьКФайлу, ПапкаРазбора) Экспорт
	
	Параметры = Новый Массив;
	Параметры.Добавить(ПутьКФайлу);	
	Параметры.Добавить(ПапкаРазбора);

	КомандаЗапуска = КомандаЗапускаДекомпилятора.Достать(Параметры);
	
	КодВозврата = КомандаЗапуска.Исполнить();
	ВыводКоманды = КомандаЗапуска.ПолучитьВывод();
	Лог.Отладка(ВыводКоманды);
	Лог.Отладка(КодВозврата);

	Если КодВозврата <> 0 Тогда
		Лог.Ошибка("Ошибка декомпиляции: " + ВыводКоманды);
		ВызватьИсключение "Не удалось разобрать файл. Возможно, формат файла не поддерживается";
	КонецЕсли;

КонецПроцедуры



