#Использовать 1connector

#Область ОбъявлениеПеременных

&Деталька("GITLAB.URL")
Перем АдресСервера;

&Деталька("GITLAB.TOKEN")
Перем Токен;

&Деталька("GITLAB.PROJECTID")
Перем ИДПроекта;

&ЛогПубликация
Перем Лог;

#КонецОбласти

&Желудь
&Прозвище("Публикатор")
&Реализует("ИнтерфейсПубликатор")
Процедура ПриСозданииОбъекта()

КонецПроцедуры

Функция Опубликовать(ТекстыМодулей, ДанныеДляРазбораФайла) Экспорт

	Ссылки = Новый Соответствие();
	АдресAPI = СтрШаблон("%1/api/v4/projects/%2/snippets", АдресСервера, ИДПроекта);

	Заголовки = Новый Структура();
	Заголовки.Вставить("PRIVATE-TOKEN", Токен);

	ФайлыДляAPI = Новый Массив;
	Для Каждого Файл Из ТекстыМодулей Цикл
		Если НЕ ЗначениеЗаполнено(Файл.Значение) Тогда
			Лог.Отладка("Файл не содержит данных для публикации: " + Файл.Ключ);
			Продолжить;
		КонецЕсли;
		ФайлДанные = Новый Соответствие();
		ФайлДанные.Вставить("file_path", Файл.Ключ);
		ФайлДанные.Вставить("content", Файл.Значение);
		ФайлыДляAPI.Добавить(ФайлДанные);
	КонецЦикла;

	Тело = Новый Соответствие();
	Тело.Вставить("title", "Код из 1С " + ДанныеДляРазбораФайла.ИмяФайла);
	Тело.Вставить("description", "Snippet создан из 1С " + ТекущаяДата());
	Тело.Вставить("visibility", "internal");
	Тело.Вставить("files", ФайлыДляAPI);

	Если ДанныеДляРазбораФайла.Обновление Тогда
		АдресЗапроса = СтрШаблон("%1/%2", АдресAPI, ДанныеДляРазбораФайла.ИДПубликации);
		Ответ = КоннекторHTTP.Put(АдресЗапроса, , Тело, Новый Структура("Заголовки", Заголовки));
	Иначе
		Ответ = КоннекторHTTP.Post(АдресAPI, , Тело, Новый Структура("Заголовки", Заголовки));
	КонецЕсли;

	Если КодСостоянияУспешный(Ответ.КодСостояния) Тогда
		ОтветJson = Ответ.Json();
		Ссылки.Вставить(Строка(ОтветJson["id"]), ОтветJson["web_url"]);
	Иначе
		Лог.Ошибка("Не удалось опубликовать в GitLab: " + Ответ.КодСостояния);
		ВызватьИсключение "Не удалось опубликовать файл в GitLab: Код состояния " + Ответ.КодСостояния;
	КонецЕсли;

	Возврат Ссылки;

КонецФункции

Функция КодСостоянияУспешный(КодСостояния)

	КодыОтвета = Новый Массив;
	КодыОтвета.Добавить(200);
	КодыОтвета.Добавить(201);

	Возврат КодыОтвета.Найти(КодСостояния) <> Неопределено;

КонецФункции
